## **Harder** Problems ðŸ““

In [1]:
import pandas as pd

### Creating a sample DataFrame

In [2]:
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'Age_doubled': [50, 60, 70]}
df = pd.DataFrame(data)

df

      Name  Age  Age_doubled
0    Alice   25           50
1      Bob   30           60
2  Charlie   35           70

### **Puzzle 1**
Select the rows where one column's value is greater than another column's value.

In [3]:
df_diff = df[df['Age'] < df['Age_doubled']]

df_diff

      Name  Age  Age_doubled
0    Alice   25           50
1      Bob   30           60
2  Charlie   35           70

### **Puzzle 2**
Find the `top 3` values in a column.

In [4]:
top_n = df.nlargest(3, 'Age')

top_n

      Name  Age  Age_doubled
2  Charlie   35           70
1      Bob   30           60
0    Alice   25           50

### **Puzzle 3**
**Normalize** the values in a DataFrame.

In [5]:
df[['Age', 'Age_doubled']] = (df[['Age', 'Age_doubled']] - df[['Age', 'Age_doubled']].min()) / (df[['Age', 'Age_doubled']].max() - df[['Age', 'Age_doubled']].min())

print(df)

      Name  Age  Age_doubled
0    Alice  0.0          0.0
1      Bob  0.5          0.5
2  Charlie  1.0          1.0

### **Puzzle 4**
Create a new DataFrame from a subset of columns in another DataFrame.

In [6]:
df_subset = df[['Name', 'Age']]

df_subset

      Name  Age
0    Alice  0.0
1      Bob  0.5
2  Charlie  1.0

### **Puzzle 5**
Find the **correlation** between columns in a DataFrame.

In [7]:
corr_ = df[['Age', 'Age_doubled']].corr()

corr_

             Age  Age_doubled
Age          1.0          1.0
Age_doubled  1.0          1.0

### **Puzzle 6**
Reshape a DataFrame with `stack` and `unstack`.

In [8]:
df_stacked = df.stack()
df_unstacked = df_stacked.unstack()

df_stacked
# df_unstacked

0  Name             Alice
   Age                0.0
   Age_doubled        0.0
1  Name               Bob
   Age                0.5
   Age_doubled        0.5
2  Name           Charlie
   Age                1.0
   Age_doubled        1.0
dtype: object

### **Puzzle 7**
Perform a **rolling average** on a column, taking `window=2` as window size.

In [9]:
df['Rolling_Average'] = df['Age'].rolling(window=2).mean()

df

      Name  Age  Age_doubled  Rolling_Average
0    Alice  0.0          0.0              NaN
1      Bob  0.5          0.5             0.25
2  Charlie  1.0          1.0             0.75

### **Puzzle 8**
Create a pivot table from a DataFrame.

In [10]:
pivot_table = pd.pivot_table(df, values=['Age', 'Age_doubled'], index='Name')

pivot_table

         Age  Age_doubled
Name
Alice    0.0          0.0
Bob      0.5          0.5
Charlie  1.0          1.0

### **Puzzle 9**
Find the row with the maximum value in a column.

In [11]:
max_row = df.loc[df['Age'].idxmax()]

max_row

Name               Charlie
Age                    1.0
Age_doubled            1.0
Rolling_Average       0.75
Name: 2, dtype: object

### Combine DataFrames using `pd.concat()`
* `axis=1` for concatenating ALONG the **columns**
* `axis=0` for concatenating DOWN the **rows** (default)

In [12]:
df1 = pd.DataFrame({
    'A': [1, 2, 3],
    'B': ['a', 'b', 'c']
})

df2 = pd.DataFrame({
    'A': [4, 5, 6],
    'B': ['d', 'e', 'f']
})

combined_df = pd.concat([df1, df2], axis=0, ignore_index=True)

combined_df

   A  B
0  1  a
1  2  b
2  3  c
3  4  d
4  5  e
5  6  f

In [13]:
# Feel free to code ...